Revit 2026 API

# JoinGeometryUtils Class

---

Utilities for joining and unjoining elements, and for managing the order in which elements are joined.

SystemObject Autodesk.Revit.DBJoinGeometryUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class JoinGeometryUtils
```
```vb
Public NotInheritable Class JoinGeometryUtils
```
```cpp
public ref class JoinGeometryUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type JoinGeometryUtils = class end
```

The JoinGeometryUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreElementsJoined | Determines whether two elements are joined. |
|  | GetJoinedElements | Returns all elements joined to given element. |
|  | IsCuttingElementInJoin | Determines whether the first of two joined elements is cutting the second element. |
|  | JoinGeometry | Creates clean joins between two elements that share a common face. |
|  | SwitchJoinOrder | Reverses the order in which two elements are joined. |
|  | UnjoinGeometry | Removes a join between two elements. |

#### Reference

Autodesk.Revit.DB Namespace